# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, LKStar, [128]] # Ganti C2f dengan LKStar
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, LKStar, [256]] # Ganti C2f dengan LKStar
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, LKStar, [512]] # Ganti C2f dengan LKStar
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, LKStar, [1024]] # Ganti C2f dengan LKStar
  - [-1, 1, SimSPPF, [1024, 5]] # Ganti SPPF dengan SimSPPF

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, LKStar, [512]] # Ganti C2f dengan LKStar

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, LKStar, [256]] # Ganti C2f dengan LKStar (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, LKStar, [512]] # Ganti C2f dengan LKStar (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, LKStar, [1024]] # Ganti C2f dengan LKStar (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
