# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P2/4 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, ECAM, [1024]] # 10 - Add ECAM after SPPF in P5 layer
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head with P2 detection
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 - cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 - cat backbone P3
  - [-1, 3, C2f, [256]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 - cat backbone P2
  - [-1, 3, C2f, [128]] # 19 (P2/4-extra small)
  - [-1, 1, ECAM, [128]] # 20 - Add ECAM before P2 detection head

  - [-1, 1, Conv, [128, 3, 2]] # 21
  - [[-1, 16], 1, Concat, [1]] # 22 - cat head P3
  - [-1, 3, C2f, [256]] # 23 (P3/8-small)
  - [-1, 1, ECAM, [256]] # 24 - Add ECAM before P3 detection head

  - [-1, 1, Conv, [256, 3, 2]] # 25
  - [[-1, 13], 1, Concat, [1]] # 26 - cat head P4
  - [-1, 3, C2f, [512]] # 27 (P4/16-medium)
  - [-1, 1, ECAM, [512]] # 28 - Add ECAM before P4 detection head

  - [-1, 1, Conv, [512, 3, 2]] # 29
  - [[-1, 10], 1, Concat, [1]] # 30 - cat head P5
  - [-1, 3, C2f, [1024]] # 31 (P5/32-large)
  - [-1, 1, ECAM, [1024]] # 32 - Add ECAM before P5 detection head

  - [[20, 24, 28, 32], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)