# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P2/4 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, ECAM, [1024]]                   # 9: ECAM after P5
  - [-1, 1, SimSPPF, [1024]]                # 10: SPPF

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12: concat P4
  - [-1, 1, C2f, [512]]                          # 13
  - [-1, 1, ECAM, [512]]                         # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                   # 16: concat P3
  - [-1, 1, C2f, [256]]                          # 17
  - [-1, 1, ECAM, [256]]                         # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 2], 1, Concat, [1]]                   # 20: concat P2
  - [-1, 1, C2f, [128]]                          # 21
  - [-1, 1, ECAM, [128]]                         # 22

  # Downsampling path again
  - [-1, 1, Conv, [128, 3, 2]]                   # 23
  - [[-1, 18], 1, Concat, [1]]                  # 24: concat back to P3-scale
  - [-1, 1, C2f, [256]]                          # 25
  - [-1, 1, ECAM, [256]]                         # 26

  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  - [[-1, 14], 1, Concat, [1]]                  # 28: concat back to P4-scale
  - [-1, 1, C2f, [512]]                          # 29
  - [-1, 1, ECAM, [512]]                         # 30

  - [-1, 1, Conv, [512, 3, 2]]                   # 31
  - [[-1, 10], 1, Concat, [1]]                  # 32: concat back to P5-scale
  - [-1, 1, C2f, [1024]]                         # 33
  - [-1, 1, ECAM, [1024]]                        # 34

  # Detection Head
  - [[22, 26, 30, 34], 1, Detect, [nc]]          # 35: Detect(P2, P3, P4, P5)