# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8 backbone
backbone:
  - [-1, 1, SPDConv, [64, 3]] # 0-P1/2
  - [-1, 1, SPDConv, [128, 3]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, SPDConv, [256, 3]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SPDConv, [512, 3]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SPDConv, [1024, 3]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SimSPPF, [1024, 5]] # 9

# YOLOv8 head with Small Object Detection (P2/4)
head:
  # Small Object Detection Head (P2/4)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P2
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C2f, [128]] # Small object detection head (P2/4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[12, 15, 18, 21], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)