# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8s with CSPDarkNet-53 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1 - P2/4
  - [-1, 3, C3, [128]]                # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3 - P3/8
  - [-1, 9, C3, [256]]                # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5 - P4/16
  - [-1, 9, C3, [512]]                # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7 - P5/32
  - [-1, 3, C3, [1024]]               # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C3, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C3, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C3, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]

