# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]]  # 1-P2/4
  - [-1,1, SPDConv,[1]]  # 2
  - [-1, 3, C2f, [128, True]]  # 3
  - [-1, 1, Conv, [256, 3, 1]]  # 4-P3/8
  - [-1,1, SPDConv,[1]]  # 5
  - [-1, 6, C2f, [256, True]]  # 6
  - [-1, 1, Conv, [512, 3, 1]]  # 7-P4/16
  - [-1,1, SPDConv,[1]]  # 8
  - [-1, 6, C2f, [512, True]]  # 9
  - [-1, 1, Conv, [1024, 3, 1]]  # 10-P5/32
  - [-1,1, SPDConv,[1]]  # 11
  - [-1, 3, C2f, [1024, True]]  # 12
  - [-1, 1, SPPF, [1024, 5]]  # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 1]]
  - [-1,1, SPDConv,[1]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 1]]
  - [-1,1, SPDConv,[1]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 27 (P5/32-large)

  - [[19, 23, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)